; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v4 ?v7)
             (pred_5 ?v10 ?v13)
             (pred_1 ?v4 ?v13)
             (pred_6 ?v12 ?v4 )
	     (pred_10 ?v4)
             (pred_4 ?v8)
             (pred_2 ?v10)
             (pred_11 ?v13)
             (pred_9 ?v4)
             (pred_12 ?v10)
             (pred_8 ?v4)
             (pred_7 ))



(:action op_4
:parameters (?v5 ?v2 ?v11 ?v3)
:precondition (and (pred_4 ?v5) (pred_4 ?v2) (pred_2 ?v11) (pred_11 ?v3)
          (pred_3 ?v5 ?v2) (pred_5 ?v11 ?v3)
                   (pred_1 ?v2 ?v3) (pred_10 ?v5) 
                   (pred_9 ?v2) (pred_12 ?v11))
:effect (and  (pred_8 ?v2) (not (pred_9 ?v2))))


(:action op_2
:parameters (?v5 ?v9)
:precondition (and (pred_4 ?v5) (pred_4 ?v9)
               (pred_10 ?v5) (pred_3 ?v5 ?v9) (pred_8 ?v9))
:effect (and (pred_10 ?v9) (not (pred_10 ?v5))))

(:action op_3
:parameters (?v5 ?v11)
:precondition (and (pred_4 ?v5) (pred_2 ?v11) 
                  (pred_10 ?v5) (pred_6 ?v11 ?v5) (pred_7 ))
:effect (and (pred_12 ?v11)
   (not (pred_6 ?v11 ?v5)) (not (pred_7 ))))


(:action op_1
:parameters (?v5 ?v6 ?v1)
:precondition (and (pred_4 ?v5) (pred_2 ?v6) (pred_2 ?v1)
                  (pred_10 ?v5) (pred_12 ?v1) (pred_6 ?v6 ?v5))
:effect (and (pred_12 ?v6) (pred_6 ?v1 ?v5)
        (not (pred_12 ?v1)) (not (pred_6 ?v6 ?v5))))

(:action op_5
:parameters (?v5 ?v11)
:precondition (and (pred_4 ?v5) (pred_2 ?v11) 
                  (pred_10 ?v5) (pred_12 ?v11))
:effect (and (pred_7 ) (pred_6 ?v11 ?v5) (not (pred_12 ?v11)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_12 obj_01 obj_17 obj_09 obj_04 obj_06 obj_20 obj_07 obj_11 obj_19 obj_21 obj_22 obj_10 obj_03 obj_15
    obj_05 obj_18 obj_08
    obj_14 obj_13 obj_02
    )

    (:init
       (pred_7)

       (pred_4 obj_16)
       (pred_4 obj_12)
       (pred_4 obj_01)
       (pred_4 obj_17)
       (pred_4 obj_09)
       (pred_4 obj_04)
       (pred_4 obj_06)
       (pred_4 obj_20)
       (pred_4 obj_07)
       (pred_4 obj_11)
       (pred_4 obj_19)
       (pred_4 obj_21)
       (pred_4 obj_22)
       (pred_4 obj_10)
       (pred_4 obj_03)
       (pred_4 obj_15)
       (pred_11 obj_05)
       (pred_11 obj_18)
       (pred_11 obj_08)
       (pred_2 obj_14)
       (pred_2 obj_13)
       (pred_2 obj_02)

       (pred_3 obj_16 obj_09)
       (pred_3 obj_16 obj_12)
       (pred_3 obj_12 obj_04)
       (pred_3 obj_12 obj_01)
       (pred_3 obj_12 obj_16)
       (pred_3 obj_01 obj_06)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_01 obj_12)
       (pred_3 obj_17 obj_20)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_09 obj_07)
       (pred_3 obj_09 obj_04)
       (pred_3 obj_09 obj_16)
       (pred_3 obj_04 obj_11)
       (pred_3 obj_04 obj_06)
       (pred_3 obj_04 obj_12)
       (pred_3 obj_04 obj_09)
       (pred_3 obj_06 obj_19)
       (pred_3 obj_06 obj_20)
       (pred_3 obj_06 obj_01)
       (pred_3 obj_06 obj_04)
       (pred_3 obj_20 obj_21)
       (pred_3 obj_20 obj_17)
       (pred_3 obj_20 obj_06)
       (pred_3 obj_07 obj_22)
       (pred_3 obj_07 obj_11)
       (pred_3 obj_07 obj_09)
       (pred_3 obj_11 obj_10)
       (pred_3 obj_11 obj_19)
       (pred_3 obj_11 obj_04)
       (pred_3 obj_11 obj_07)
       (pred_3 obj_19 obj_03)
       (pred_3 obj_19 obj_21)
       (pred_3 obj_19 obj_06)
       (pred_3 obj_19 obj_11)
       (pred_3 obj_21 obj_15)
       (pred_3 obj_21 obj_20)
       (pred_3 obj_21 obj_19)
       (pred_3 obj_22 obj_10)
       (pred_3 obj_22 obj_07)
       (pred_3 obj_10 obj_03)
       (pred_3 obj_10 obj_11)
       (pred_3 obj_10 obj_22)
       (pred_3 obj_03 obj_15)
       (pred_3 obj_03 obj_19)
       (pred_3 obj_03 obj_10)
       (pred_3 obj_15 obj_21)
       (pred_3 obj_15 obj_03)
       (pred_9 obj_06)
       (pred_9 obj_11)
       (pred_9 obj_21)
       (pred_1  obj_06 obj_05)
       (pred_1  obj_11 obj_18)
       (pred_1  obj_21 obj_08)
       (pred_8 obj_16)
       (pred_8 obj_12)
       (pred_8 obj_01)
       (pred_8 obj_17)
       (pred_8 obj_09)
       (pred_8 obj_04)
       (pred_8 obj_20)
       (pred_8 obj_07)
       (pred_8 obj_19)
       (pred_8 obj_22)
       (pred_8 obj_10)
       (pred_8 obj_03)
       (pred_8 obj_15)

       (pred_5  obj_14 obj_05)
       (pred_5  obj_13 obj_18)
       (pred_5  obj_02 obj_08)
       (pred_6 obj_14 obj_12)
       (pred_6 obj_13 obj_09)
       (pred_6 obj_02 obj_16)
       (pred_10 obj_10)
    )

    (:goal (and
       (pred_6 obj_13 obj_19)
       (pred_6 obj_02 obj_19)
    ))
(:constraints
  (always (not (pred_10 obj_04)))
)
)

; plan
1. (op_2 obj_10 obj_22)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_22)
   goals met: 0 of 2
2. (op_2 obj_22 obj_07)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_07)
   goals met: 0 of 2
3. (op_2 obj_07 obj_09)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_09)
   goals met: 0 of 2
4. (op_3 obj_09 obj_13)
   deleted: (pred_6 obj_13 obj_09) (pred_7)
   added: (pred_12 obj_13)
   goals met: 0 of 2
5. (op_2 obj_09 obj_07)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_07)
   goals met: 0 of 2
6. (op_4 obj_07 obj_11 obj_13 obj_18)
   deleted: (pred_9 obj_11)
   added: (pred_8 obj_11)
   goals met: 0 of 2
7. (op_2 obj_07 obj_11)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_11)
   goals met: 0 of 2
8. (op_2 obj_11 obj_19)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_19)
   goals met: 0 of 2
9. (op_5 obj_19 obj_13)
   deleted: (pred_12 obj_13)
   added: (pred_7) (pred_6 obj_13 obj_19)
   goals met: 1 of 2
10. (op_2 obj_19 obj_11)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_11)
   goals met: 1 of 2
11. (op_2 obj_11 obj_07)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_07)
   goals met: 1 of 2
12. (op_2 obj_07 obj_09)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_09)
   goals met: 1 of 2
13. (op_2 obj_09 obj_16)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_16)
   goals met: 1 of 2
14. (op_3 obj_16 obj_02)
   deleted: (pred_6 obj_02 obj_16) (pred_7)
   added: (pred_12 obj_02)
   goals met: 1 of 2
15. (op_2 obj_16 obj_09)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_09)
   goals met: 1 of 2
16. (op_2 obj_09 obj_07)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_07)
   goals met: 1 of 2
17. (op_2 obj_07 obj_11)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_11)
   goals met: 1 of 2
18. (op_2 obj_11 obj_19)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_19)
   goals met: 1 of 2
19. (op_5 obj_19 obj_02)
   deleted: (pred_12 obj_02)
   added: (pred_7) (pred_6 obj_02 obj_19)
   goals met: 2 of 2
